---
kind: type
id: T:Autodesk.Revit.DB.Visual.MetallicpaintPearlType
source: html/a9fbd00c-d3c6-da9d-26ff-7b6b2334458f.htm
---
# Autodesk.Revit.DB.Visual.MetallicpaintPearlType

The enumerated type representing the permitted values for the asset property "MetallicpaintPearl" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public enum MetallicpaintPearlType
```